## Pandas

**Introdução ao Pandas**

*Autor: Danillo de Souza*

**Criação de um DataFrame**

In [1]:
import numpy as np
import pandas as pd

In [2]:
# df = pd.DataFrame([['A','B','C'], [1,2,3]])
# df = pd.DataFrame({'A':[1,2,3],'B':[2,4,6],'C':[4,8,12]})
# df = pd.DataFrame(np.random.rand(4,3))
df = pd.DataFrame(np.random.randint(1,10,8).reshape(2,4),
                 columns=['São Paulo','Corinthians','Palmeiras','Santos'],
                 index=['Gols','Vitorias'])
df

          São Paulo  Corinthians  Palmeiras  Santos
Gols              5            2          3       7
Vitorias          5            8          6       5

**Seleção de Dados**

In [3]:
df['São Paulo']

Gols        5
Vitorias    5
Name: São Paulo, dtype: int32

In [4]:
df['Santos']['Gols']

7

In [5]:
df.Palmeiras

Gols        3
Vitorias    6
Name: Palmeiras, dtype: int32

In [6]:
df

          São Paulo  Corinthians  Palmeiras  Santos
Gols              5            2          3       7
Vitorias          5            8          6       5

In [7]:
df.loc['Vitorias']

São Paulo      5
Corinthians    8
Palmeiras      6
Santos         5
Name: Vitorias, dtype: int32

In [8]:
df.loc[['Vitorias'],['São Paulo', 'Corinthians']]

          São Paulo  Corinthians
Vitorias          5            8

In [9]:
df.iloc[0]

São Paulo      5
Corinthians    2
Palmeiras      3
Santos         7
Name: Gols, dtype: int32

In [10]:
df.iloc[0,0:4]

São Paulo      5
Corinthians    2
Palmeiras      3
Santos         7
Name: Gols, dtype: int32

**Adição e Remoção de Linhas e Colunas no DataFrame**

In [11]:
df['Bragantino'] = [9,8]
df

          São Paulo  Corinthians  Palmeiras  Santos  Bragantino
Gols              5            2          3       7           9
Vitorias          5            8          6       5           8

In [12]:
df.loc['Empates'] = [2,5,3,2,1]
df

          São Paulo  Corinthians  Palmeiras  Santos  Bragantino
Gols              5            2          3       7           9
Vitorias          5            8          6       5           8
Empates           2            5          3       2           1

In [13]:
df.drop('Bragantino', axis=1)

          São Paulo  Corinthians  Palmeiras  Santos
Gols              5            2          3       7
Vitorias          5            8          6       5
Empates           2            5          3       2

In [14]:
df.drop('Bragantino', axis=1, inplace=True)
df

          São Paulo  Corinthians  Palmeiras  Santos
Gols              5            2          3       7
Vitorias          5            8          6       5
Empates           2            5          3       2

In [15]:
del df['Palmeiras']

In [16]:
df

          São Paulo  Corinthians  Santos
Gols              5            2       7
Vitorias          5            8       5
Empates           2            5       2

In [17]:
df.drop('Empates', axis=0)

          São Paulo  Corinthians  Santos
Gols              5            2       7
Vitorias          5            8       5

In [18]:
df.drop('Empates', axis=0, inplace=True)
df

          São Paulo  Corinthians  Santos
Gols              5            2       7
Vitorias          5            8       5

In [19]:
df2 = pd.DataFrame({'A':[1,np.nan,3],'B':[2,4,6],'C':[4,8,np.nan]})
df2

     A  B    C
0  1.0  2  4.0
1  NaN  4  8.0
2  3.0  6  NaN

In [20]:
df2.dropna()

     A  B    C
0  1.0  2  4.0

In [21]:
df2.fillna('Dan')

     A  B    C
0    1  2    4
1  Dan  4    8
2    3  6  Dan

In [22]:
df2.fillna(value=df2['B'].mean())

     A  B    C
0  1.0  2  4.0
1  4.0  4  8.0
2  3.0  6  4.0